
HEIGHT=900
WIDTH=900
TITLE="RUZYEF"
GRAY=(128-32,128-32,128-32)
BLACK=(0,0,0)
WHITE=(255,255,255)
YELLOW=(255,255,0)
RED=(255,0,0)
BLUE=(0,0,255)
BACK=-1
NOT_BACK=0
CHANGE=1
FPS_SCL=60
TIME_SCL=(1/60)
GAME_SCL=(1/10)
KERO_SCL=(4/10)
G=9.8*TIME_SCL
"""
1.クリックで選択
2.右で移動、左で撃つ
3.反撃してくる、くれる
4.timeいじれる
5.timeと目標を閉じれる
6.map特性
"""

EX_TXT_1="1.マップ上に赤もしくは青で囲われた記号があり、それが部隊です\n　クリックすると赤い円が出てきて選択されたことになります。\n　右クリックは複数選択、左クリックは単一選択です\n"
EX_TXT_2="2.マップ上を右クリックでおすと、選択した部隊をその場所に移動\n　できます。左クリックの場合はその場所を撃つことができます\n"
EX_TXT_3="3.敵の部隊の100m以内に自分の部隊を入れると撃たれます。自分\n　の部隊も敵の部隊も撃たれて被害が出たら撃ってきた部隊に反撃\n　します\n"
EX_TXT_4="4.左上に現在の時間を表示するものがあります。そこのついてるボ\n　タンを押すことで速度を変えることができます。左から0速,1速,\n　2速,4速となってます\n"
EX_TXT_5="5.左上の現在の時間を表示するものはｔキーで閉じれます。右上の\n　目標を表示するものはspaceキーで閉じれます。戻る時はEscキー\n　を押してください"
EX_TXT_6="6.地形は部隊に恩恵や害をあたえます。川(水色)は移動速度が下が\n　り道路(茶色)や鉄道(黒)は移動速度が上がります。森林(緑色)や\n　住居(灰色)は若干移動底度が下がりますが防御力があがります\n"
